The plan is saved for 1d1265822a72d9419cecec9de71370e3c22a3460.
Use `/apply` to apply the plan and merge this PR.
<details><summary>Show output</summary>

```
warning: file 'nixpkgs' was not found in the Nix search path (add it using $NIX_PATH or -I), at (string):1:9; will use bash from your environment
module.staging.module.minio.sakuracloud_packet_filter.switch: Refreshing state... [id=113300785254]
module.staging.module.nightly.sakuracloud_packet_filter.external: Refreshing state... [id=113300785255]
module.staging.module.minio.random_password.access_key: Refreshing state... [id=none]
module.staging.module.minio.random_password.secret_key: Refreshing state... [id=none]
module.staging.module.database.random_password.password: Refreshing state... [id=none]
module.staging.module.database.random_password.username: Refreshing state... [id=none]
module.staging.module.database.sakuracloud_disk.data_disk: Refreshing state... [id=113300785257]
module.staging.module.database.sakuracloud_packet_filter.switch: Refreshing state... [id=113300785258]
module.staging.module.beta.sakuracloud_packet_filter.external: Refreshing state... [id=113300785256]
module.staging.sakuracloud_switch.internal: Refreshing state... [id=113300785252]
sakuracloud_internet.router: Refreshing state... [id=113300785259]
module.staging.module.minio.sakuracloud_disk.data_disk: Refreshing state... [id=113300785253]
cloudflare_record.beta: Refreshing state... [id=64701e3b4af429824f1d3233eedf2e9e]
cloudflare_record.nightly: Refreshing state... [id=fe032f5902580f96a1885eefc9a1896d]
module.staging.module.minio.module.nixos_minio.sakuracloud_archive.nixos: Refreshing state... [id=113300794295]
module.staging.module.minio.sakuracloud_disk.disk: Refreshing state... [id=113300794332]
module.staging.module.minio.sakuracloud_server.minio: Refreshing state... [id=113300794442]
module.staging.module.database.module.nixos_database.sakuracloud_archive.nixos: Refreshing state... [id=113300794290]
module.staging.module.database.sakuracloud_disk.disk: Refreshing state... [id=113300794322]
module.staging.module.database.sakuracloud_server.database: Refreshing state... [id=113300794443]
module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300794292]
module.staging.module.nightly.sakuracloud_disk.server_disk: Refreshing state... [id=113300794325]
module.staging.module.nightly.sakuracloud_server.server: Refreshing state... [id=113300794440]
module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos: Refreshing state... [id=113300794289]
module.staging.module.beta.sakuracloud_disk.server_disk: Refreshing state... [id=113300794323]
module.staging.module.beta.sakuracloud_server.server: Refreshing state... [id=113300794441]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.module.beta.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300794323" -> (known after apply)
        name              = "sos21_staging_server_disk"
      ~ server_id         = "113300794441" -> (known after apply)
      ~ source_archive_id = "113300794289" -> (known after apply) # forces replacement
        tags              = [
            "sos21_beta",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.beta.sakuracloud_server.server will be updated in-place
  ~ resource "sakuracloud_server" "server" {
      ~ disks            = [
          - "113300794323",
        ] -> (known after apply)
        id               = "113300794441"
        name             = "sos21_staging_server"
        tags             = [
            "sos21_beta",
            "sos21_server",
            "sos21_staging",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.staging.module.nightly.sakuracloud_disk.server_disk must be replaced
-/+ resource "sakuracloud_disk" "server_disk" {
      ~ id                = "113300794325" -> (known after apply)
        name              = "sos21_staging_server_disk"
      ~ server_id         = "113300794440" -> (known after apply)
      ~ source_archive_id = "113300794292" -> (known after apply) # forces replacement
        tags              = [
            "sos21_nightly",
            "sos21_server_disk",
            "sos21_staging",
        ]
        # (4 unchanged attributes hidden)
    }

  # module.staging.module.nightly.sakuracloud_server.server will be updated in-place
  ~ resource "sakuracloud_server" "server" {
      ~ disks            = [
          - "113300794325",
        ] -> (known after apply)
        id               = "113300794440"
        name             = "sos21_staging_server"
        tags             = [
            "sos21_nightly",
            "sos21_server",
            "sos21_staging",
        ]
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.staging.module.beta.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/8zzaif1smmp78x1ycwd1vsi1sga97yv9-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17.img" -> "modules/sakuracloud_archive_nixos_custom/.built_image/klircqnw5dnvi7dx80k8m54yq81pywlz-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17.img" # forces replacement
      ~ description  = "8zzaif1smmp78x1ycwd1vsi1sga97yv9-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17" -> "klircqnw5dnvi7dx80k8m54yq81pywlz-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17"
      + hash         = (known after apply) # forces replacement
      ~ id           = "113300794289" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_beta",
            "sos21_staging",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.staging.module.nightly.module.nixos_archive.sakuracloud_archive.nixos must be replaced
-/+ resource "sakuracloud_archive" "nixos" {
      ~ archive_file = "modules/sakuracloud_archive_nixos_custom/.built_image/4v552gii1ysnahnipcdpdmncaxl0ylsw-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17.img" -> "modules/sakuracloud_archive_nixos_custom/.built_image/5b8nqar1bil1d8q1q3jcyzsinqz136b7-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17.img" # forces replacement
      ~ description  = "4v552gii1ysnahnipcdpdmncaxl0ylsw-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17" -> "5b8nqar1bil1d8q1q3jcyzsinqz136b7-sakuracloud-server-image-94fcf8c37f79af47c9ad4a5d64b4c0844a49052e698075673a375a5100933d17"
      + hash         = (known after apply) # forces replacement
      ~ id           = "113300794292" -> (known after apply)
        name         = "sos21_staging_nixos"
        tags         = [
            "sos21_archive_nixos",
            "sos21_nightly",
            "sos21_staging",
        ]
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.
```
</details>